export default {
	/**
	 * リバーシへの誘いを承諾するとき
	 */
	REVERSI_OK: '良いですよ～',

	/**
	 * リバーシへの誘いを断るとき
	 */
	REVERSI_DECLINE: 'ごめんなさい、今リバーシはするなと言われてます...',

	/**
	 * (メモリが足りないので)再起動がスケジュールされたとき
	 */
	REBOOT_SCHEDULED_MEM: 'サーバーの空きメモリが少なくなってきたので、1分後にサーバー再起動しますね！',

	/**
	 * (CPU使用率が高いので)再起動がスケジュールされたとき
	 */
	REBOOT_SCHEDULED_CPU: 'サーバーの負荷が高いので、1分後にサーバー再起動しますね！',

	/**
	 * まもなく再起動されるとき
	 */
	REBOOT: 'では、まもなくサーバーを再起動します！',
	REBOOT_DETAIL: '(私も再起動に巻き込まれちゃうので、サーバーの再起動が完了したことのお知らせはできません...)',

	REBOOT_CANCEL_REQUESTED_ACCEPT: 'わかりました。再起動の予定を取り消しました！',
	REBOOT_CANCEL_REQUESTED_REJECT: 'ごめんなさい、再起動の取り消しは管理者のみが行えます...',

	REBOOT_CANCELED: '再起動が取り消されました。お騒がせしました',

	/**
	 * 絵文字生成
	 */
	EMOJI_SUGGEST: 'こんなのはどうですか？→$',

	FORTUNE_CW: '私が今日のあなたの運勢を占いました...'
};
